src/БазоваяКонфигурация.ГенераторПользовательскихРолей/src/Enums/гпр_РежимыВыгрузкиКонфигурации/гпр_РежимыВыгрузкиКонфигурации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гпр_РежимыВыгрузкиКонфигурации</name>
  <enumValues>
    <name>КонфигурацияВыгруженаВКаталог</name>
  </enumValues>
  <enumValues>
    <name>КонфигурацияНеВыгруженаВКаталог</name>
  </enumValues>
</mdclass:Enum>

src/БазоваяКонфигурация.ГенераторПользовательскихРолей/src/CommonForms/гпр_Настройки/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2024, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьНастроек();
	
	СписокВыбораРежимаЗагрузки = Элементы.гпр_РежимВыгрузкиКонфигурации.СписокВыбора;
	СписокВыбораРежимаЗагрузки.Добавить(Перечисления.гпр_РежимыВыгрузкиКонфигурации.КонфигурацияВыгруженаВКаталог);
	СписокВыбораРежимаЗагрузки.Добавить(Перечисления.гпр_РежимыВыгрузкиКонфигурации.КонфигурацияНеВыгруженаВКаталог);
	
	// Получим пользователей ИБ
	СписокПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	СписокВыбораПользователей = Элементы.гпр_ПользовательБазы.СписокВыбора;
	
	Для Каждого ТекущийПользователь Из СписокПользователей Цикл
		СписокВыбораПользователей.Добавить(ТекущийПользователь.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если НаборКонстант.гпр_РежимВыгрузкиКонфигурации = 
		ПредопределенноеЗначение("Перечисление.гпр_РежимыВыгрузкиКонфигурации.КонфигурацияВыгруженаВКаталог")
		И ПустаяСтрока(НаборКонстант.гпр_КаталогВыгрузкиКонфигурации) Тогда
		Отказ = Истина;
		СообщениеПользователю = Новый СообщениеПользователю();
		СообщениеПользователю.Текст = НСтр("ru ='Не указан каталог выгрузки конфигруации в файлы.'");
		СообщениеПользователю.Поле = "гпр_КаталогВыгрузкиКонфигурации";
		СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура гпр_РежимВыгрузкиКонфигурацииПриИзменении(Элемент)
	
	УстановитьВидимостьНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура гпр_КаталогВыгрузкиКонфигурацииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Каталог = НаборКонстант.гпр_КаталогВыгрузкиКонфигурации;
	
	Обработчик = Новый ОписаниеОповещения(
		"ВыборКаталогаXMLПродолжение",
		ЭтотОбъект);
	
	ДиалогВыбораФайла.Показать(Обработчик);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьНастроек()
	
	Элементы.ГруппаКаталогаВыгрузки.Видимость = (НаборКонстант.гпр_РежимВыгрузкиКонфигурации = 
		Перечисления.гпр_РежимыВыгрузкиКонфигурации.КонфигурацияВыгруженаВКаталог);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаXMLПродолжение(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора <> Неопределено 
		И РезультатВыбора.Количество() > 0 Тогда
		НаборКонстант.гпр_КаталогВыгрузкиКонфигурации = РезультатВыбора[0];
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
